#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "3fd9d8e246da48df265a2b56c6a6a214" -> "48cc375bf147b745939e1ab3698d224e"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "f98d32ef9e1e209a481def328949afc3" -> "1ea57b1cf2eb3c00972b28381d824eae"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "11f935a16b96181b5f1d60b533a5244e" -> "699746dec28cca32743e012d18b8c786"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8dfbde83d9bf9635cc2193603b784e20" -> "c3b672bf03f8eca5cdcd8efc8d9b098f"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "a59a67f4f6b68dc1f16dc51d4d190c73" -> "1e9f893aa569b5033b53da56f1245088"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "dfd74caf97dd029a0271a1d87e0a5334" -> "e6e90cbdade103cb1496d1484d34ab88"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "cbf1eec6057e6d8b46c230cd1e943655" -> "490a71b64963b822dfc33ae2d04d21b9"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "87752ff805b25a46eeb2bbc23a8838ca" -> "fca4e3e5fda5891e7c63e1197d96fa93"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f9a2e52a579c7b07c08a12e9a7265d2" -> "e2e65a8c53452fdc900ae4803d6a9d4b"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f45863c38e435d983abec4a4d679a2a8" -> "68ddcb818e74db33227b869aad9bd01f"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3f2109d6d262256255a07a6af1de532d" -> "0a38ca2f0e3dfa7b798baa0265e4f998"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "6e9f730a70967c6322be08b4426a76e1" -> "5324229e9d5545fb72f049ba607f3440"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c167a9068e55f5c918a34a973de0a1ee" -> "c1668b9811a3da192da45bc1806dfc8b"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "bec63d2b002c7a5d40a5f63854535c1b" -> "8fc7ad8f91b17227ee955e6aa9a1e963"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "c9bb8b943ba0395ac02e8af4007400bb" -> "1b4020a34e3756e500c7de1f34cd3d9b"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "34a83bc43fc9bf85beff704b890b544b" -> "6b5f2c79327c3d0c1535a4fb614fd62a"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f3c9c0f610f9b6930eca6932ac507fde" -> "21159a1886f6b6aec71a4858224c5eae"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "95c0c6db0db31b750b5f63a71a1dc0da" -> "63a236fe084b36769a707a00cd744e29"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "b85092f35e25bec659083eadbc29afed" -> "c6c6465d50dbf206c3248cdc856b19c1"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f41897f87448f72dfe418df6dbbbb62c" -> "9a341f9fd87a4ecd8e9a6452cbbf59f9"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "825ebda657d1f5f435b82b1df4bfb47c" -> "a72674c7841b193b2d217a3e51d88952"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "841a340e2969777842f6bcf9ae1909a6" -> "21cde0429e3684056175de5ad4ddf8d4"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "d4dc24a982673669115af458c04db206" -> "262a42750652a2fbff2000878ba4c367"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "64f56bb13e451ce4d349bccaf6a996e4" -> "9c6f153fb9a95670b42d036c6784a832"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6850a38fab0a26a248459c42e76206ca" -> "eb0185217043f0cab612ff4b0344e848"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "0ed216389cc49084a9b9926be4cab436" -> "d8cff2a6d6e8f3323af113380fd6853b"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a32a014813b70da72dc073aac79413cc" -> "aba38870fcc5b7a95cd08f68fedb42b6"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7e2a84615c2f77e3e20248495aba237a" -> "373a1b422e567b3d04091de7fade61d6"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "4d9002d1db480f54a67e19e3cf69aeec" -> "8dfd2025a75ee1e689b003eae5c5bee8"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "048f2fa6c2eaebe03e456125336380da" -> "22d42078a05e41223d2e43b5403b553d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "942c10cc404adb0f22c8cc3fe44dc9bf" -> "b48ec636753d0d929a124b1b7b074933"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "97549c484694aa579fe8a864459cec7e" -> "41faa3f1a0dd2cb3240ac048cece159b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e2a5ec3983efa9ac1572e4032263dd77" -> "aec3a27cf8cb0b9affa9eb1512748513"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6bcacef4498c40b184b74ccda2deaf22" -> "78d1219e3c808da8dcbf3e1b93190cc2"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e88b19c2499f6ef1a97a722c66f83d42" -> "6581c862335aff4af1b1455bf06091f1"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "d3fa3dd06a94784d79906f688d8c97a1" -> "b8c6e3c03cffc3f744f7d68bcaf62598"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "26d5f2876d9575af3dfbe21efb3c6bfb" -> "cbbdbe5fe8cf3e95d5a54ae7afdb2aa0"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "394bfb21615993dbbae624a27baec5e4" -> "291a20b78a14ac2487fad7f861dfe38f"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "eed8fd2ba6e0b0964f5468cd349864a1" -> "907ba0874889bbda51833cba5a431463"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "182e3a90e15667ab0466b3faa8180bf7" -> "86aab6e43e9a1a55b54e89fabda87cd4"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "270478b4340359e7c2772c85809e55fe" -> "80042ad54772ed8f08c0a4c8f8a3df60"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "48f99cf2abe811a0a9146c5a4cd59618" -> "7f609b1cf4af087b9aebab7b19bae870"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4779926d16b7cf2ef5ea6fc6f221d8a6" -> "25c10019ffe79f1be472db3bad22d3d8"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGr/mwjOLYX0LQRqh2gNgdS1rB+PQND0Jy15RpC+jc=" -> "3L3/eW4nsW3u7OF95USRIfiIs0dxTx2y4FivQU1KVrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vs7SjePrS8gY8XSNu+lYHctfGM5sAYDjKdHTRw5ufsM=" -> "ls4MaLCCkmo/d5UBIX8cjCotM/Rwjn/Tj9liOQ+s8fM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcF1T8MPsERT7W10lMu5WTVx2BEqNfuIZVNoRwZkvhg=" -> "0R9CGysqbFboxZ/jFS2M5dBsZh2YlL9Tnw5bbbnSvPw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6nGKT7DuSNL9X0QvZbGqL6061WKlPFxmqZPSqm3UQ0=" -> "U11jp+6+ZG3uWL+rhSvepKNmxke2HAsIklCVAf+0oOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "gZn3mNzqb+Z2Ulnu/AaH0nd0QhDFANjFDuB3Wkk+SnA=" -> "gRvVDQay9fmH43rpZNLnpES140I5MMy4YzlFFyXKfnk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "QBARFicV8aMsMejbusiB9tG4ss0eGJ33eT7u6h6oerc=" -> "vGrvzgVGPB/eSG7XLuSPH7ACch1Kuj5OXwCeqRNgNZo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuVHQbNLqw5R0luyu2wMatebbGD8k41A4YiCLoGdIsU=" -> "e5c6UZ/p4coYGFLVzpqKHJMLp7aHdlWr48yaTqZe7xA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "RjbQ7qmaPGGxzia459HD/nhp6oKglMLdMxVRIiOZm1g=" -> "UWFWNmMDQfGofPm6YowB9Z7cvVGNF/iCHb5xhX4wVFo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUHMr65V/2Q7ICHoHVWmrmof2r2xrhDscnxG6GjboPs=" -> "iN6EBomm8IX6mVWCRgryrXm75YJDb1Evp0EqHg+8VQ0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "/5+K7GTvHKWBGKLRKjQF+XA3DPHe6mqPH4lVOkk9Ai8=" -> "dYkHhkuS2qAhxG57QM6wbdvKJDob6VqcaZwAMcPoP8M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "s0s/xS64v+7MfGSHE8NBzVZELpRogJkYgW2Ly3SXaOY=" -> "IiA5MmAGO3JeBITGwiYkA8NaIXZ2F3oW0mB1+bRqvGY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WvvxCG2MBHXb58Qdjy3O+kB4eV67Dyn2nZAbG/dLjaU=" -> "qQp1UEwPOtitE9DIwZb3g5ww+L+rzcdu12sdUi5cfGc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "WfSX6RJaW4ENU6xP/P/gpy4yRv6ospmLEqrdJxdxFZI=" -> "vGTSu8vcX0NMNf16s2cLV2MgBuYIZzcRxoDtzCWUP9U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "4AkT9JE2Xe+AMDnHrwdGCddqk9LO+yhLfETqOAqBFV0=" -> "9nGhAI0ouwRnUcQgTeq+HRZNd44Y/uG5AqHYFQJVr4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "hMSKal/wJ1XwkUbECOGvT56THAbHdXqVO3g8n4ZxNVM=" -> "PC3570HUm+PsynIizNeMupM7/OZ0062ROL1kA8nMmIg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEfGDPexcle4umaBCmkzzvwMPWE5Hxg4m7Ub8tpbM1k=" -> "uLmLtfVMgzU+F7dixlc5Shx1o7ttYUZC9Wp37fDMQMU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hn9if487roM4UaqV+Atnyxi683F/qi/PC3PFLux90DU=" -> "pPG1MZuy5NGa6oYZuZDsqaKeGTWO9LS3iD4qEM88Oqg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-01T20:43:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "CS/UZkEjhXDDR+YkZmTcn3k0NOLU6Ncp+IZUHMdCYkM=" -> "1PU6tTw6iQ9WB+Z9nO2gCEvfKZxla3F+8W2agZOlfUw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3Ccu5198aKGRv5n99K6tb51vB6VfGP6r4GPbsqBBhg8=" -> "B9gdjbTr+xtiqXtIZIvkb9176iKDjHhAz5CDqlw/UPQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "iWRK/WvqG7zteJa3TGBaYf/6Uc/MJDjdONKMUW7UEVg=" -> "G2A371jhHql31wD+U6L/vkUmp9nVbIS2YJ+UfvkumLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3DxJQse/usODcSM62/ng7/NDSTMAXSKE6t8EV84IG7A=" -> "IzZwPus9lM70/ABdZWeAbczXTfGjwlmCAnK5w+aQqmI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "nIxmvcsGnEQj/3JikzTho5uvSolB1kgGHBr6vnkvRSk=" -> "QzIehiRW7GmYzJ55OI/tkXb0V8MesVq7Zweyz9uC/9E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "o61Qn/k1HZpmwEXNfVxVVXZ9y5CNoH8+hND8nyR8xIc=" -> "eBg7S1HyA2P7URVWYr2PZS30UjLSNTvk5+Ku7jNHsXc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRg1n9vvr+qzEUyGMLU2DlRWURCVCHQPLLQgKVfefkQ=" -> "IsF2s2ihZHjL+zJksBvyUhPEbsbsfjx3cB+U7xc9GcA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BxE/oLkR7+ssQWkKuoCZhyjdQj2zXHgXHce6vWwcv4k=" -> "8pdkHddJW+RlQoOzS54TYjUWNecVDlA7oN+5T3h9wJ4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "daKXo+d0SnGXXJELltf5+0KF9qu3Pi5xAJyVPrPpy0o=" -> "CF2YraNVOth/Y6jrD0PhQPfYG9JX7Tp7HxJWIX7NCrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVVP6bbzFbybG/b5c8xfc1Hz10S0mcAFDdybPn3SJU8=" -> "Ghilh/I/YdolbuF4KBvNXJlrKi/GLZipiCCK64wQhDY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "FtFycq+75wH7WmejM0EfQg7UuSbTutqXJwsvBl+foKY=" -> "9+UPxEPLz9LQJDRR73kRDSV+VutzyQSQyBYINjiMRbI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "DhVn4RBj9XpQ3oHcKcD+yYvhXpDQBRlIBGf2fxWChuY=" -> "Sx3FrdgdU7nMg0LLb8yLuk+ZTWABxjrmVqkqslhkNG8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "8jMpFs8EvfaQMhLwOp/nDbcjT5Bx//4ayLRX5ZpmI2I=" -> "q5hLUyEeBNwJ4QU3q7fkp60X44P5HtKX8kXwjw1C8E8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkSUJZg+ARrrCv1yFQ20VJk1pmcxOEb4UOuo3Hyyhc4=" -> "r9BwdQALFM2+9yDlQRDfDLzPeIHBzzNVEcKKvbZ3axU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gDKR3dicxdeoZRaod9aXDiIjmqpD9I2qxiQkn0H82MQ=" -> "6wi5XJhJGPVtJDJ3yCqbO6SnYcji8AFCAbE9nve/Bjo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYWGtyI5Lqv3jrUzu/sr+7dWU8ZLr5/4KcXrgxV64Iw=" -> "xYBzKlvqAYKByUXOK5ChAoV5cyRf3Y6NHDOqisDJGNM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "e6eVu1PC03Kv1ti843nF7zO70gQSkgR0LE5s6g3azmU=" -> "o+MLaqOzPqzYo3TQUrT/tTcgrM8ufTPgQ7e1X1QKRq0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "luU1ZGPaN9Hf9KTPtentAC5C9f2eyqaA1kTiN7m9N1s=" -> "g3a1jNaQSln3+qQBO+DjQimdsyHogqMkz4f+WdDJhag="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "j1aYXpmP9J12jikw2d0hF3R4/CC+t42xQ/+spuvQXLI=" -> "Toangdmtjk3uYiWwO3v93uWs8tlvKgIYItBVgqq27XU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "lE5qhPbfP0aBmYZHtLGUszigfzXAWryafFEU6CZm8eo=" -> "8qZIdyXg703OIfVj2ssFyA9HUmldJZ19JU43WGH+1xw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "LCDdX0VpXrfCDv7lmh9iFHtr5/18DIrngpiNukwwv18=" -> "GqYWeUkpTy+8JCSgxZ/sxJO98qbl6pXOY3rL/cOeWG8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RI9iFlD471X1/y3qRpSAHEBTEyTCyVFD9y7ucpdt+2I=" -> "SjoyEq5dCXXqWQzNI/xrMChTWy6wLqWMqelWKAXlYsg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "j0CwaifjbZS5bozE7Bt01THRus6golSg3MrNam7at6I=" -> "W8CCAYkbc9Xq1S/miD2M90h1phV346HoRHEyv/WD/Ys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "gsZVR5KW35jFJMuJtHrW6fKkct6IQRmQNl/taBmM2LQ=" -> "cf2rOuUzYRs5Q4LG0KB6D9/A3C32yo5pTrcLFd5156s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "7MuPFDFN6Ic8GPoxF88DfO9O1To1XufVVd3FV55Ld8k=" -> "uKNU/7PSQOVg52Vh50EPA51Ym+mbOukhReuUOKxR38w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-31T22:46:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xy4ll8" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-31T22:46:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-31T22:49:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 87 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*